Repository: derzse/MV_site_temp
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ro

source: Modus Vivendi Oradea - FTC Robotics Team | Innovation in Oradea
ro: Modus Vivendi Oradea - Echipa FTC | Inovație în Oradea

source: About Modus Vivendi | FTC Team Oradea - 8 Years Experience
ro: Despre Modus Vivendi | Echipa FTC Oradea - 8 Ani Experiență

source: Privacy Policy | Modus Vivendi Oradea FTC Team
ro: Politica de Confidențialitate | Echipa FTC Modus Vivendi Oradea

source: Contact Modus Vivendi | FTC Robotics Team Oradea
ro: Contactează Modus Vivendi | Echipa FTC Robotică Oradea

source: Our FTC Projects | Modus Vivendi Robotics Oradea
ro: Proiectele Noastre FTC | Modus Vivendi Robotică Oradea

source: FTC Events & Competitions | Modus Vivendi Oradea
ro: Evenimente și Competiții FTC | Modus Vivendi Oradea

source: Our FTC Team Members | Modus Vivendi Oradea
ro: Membrii Echipei FTC | Modus Vivendi Oradea

source: FTC Awards & Achievements | Modus Vivendi Oradea
ro: Premii și Realizări FTC | Modus Vivendi Oradea

source: Modus Vivendi Oradea - FIRST Tech Challenge Team
ro: Modus Vivendi Oradea - Echipa FIRST Tech Challenge

source: seo_description_home
ro: Modus Vivendi Oradea este prima și cea mai experimentată echipă FTC din Oradea, cu 8 ani de experiență în robotică competițională FIRST Tech Challenge.

source: seo_description_about
ro: Descoperă povestea echipei FTC Modus Vivendi Oradea - 8 ani de inovație în robotică competițională și educație STEM pentru tineri.

source: seo_description_privacy
ro: Politica de confidențialitate a echipei FTC Modus Vivendi Oradea - cum protejăm datele membrilor și vizitatorilor site-ului nostru.

source: seo_description_contact
ro: Contactează echipa FTC Modus Vivendi Oradea pentru colaborări, sponsorizări sau informații despre programele noastre de robotică.

source: seo_description_team
ro: Cunoaște membrii echipei FTC Modus Vivendi Oradea - tineri pasionați de robotică, programare și inovație tehnologică.

source: seo_description_projects
ro: Explorează proiectele robotice ale echipei FTC Modus Vivendi Oradea - de la roboți competiționali la inovații tehnologice.

source: seo_description_achievements
ro: Descoperă premiile și realizările echipei FTC Modus Vivendi Oradea în competițiile FIRST Tech Challenge din România și Europa.

source: seo_description_default
ro: Modus Vivendi Oradea - echipa FTC cu cea mai mare experiență din Oradea în robotică competițională și educație STEM.

source: Home Page
ro: Pagina Principală

source: Stay tuned for updates.
ro: Rămâi la curent cu noutățile.

source: donate_message
ro: este o organizație non-profit și depinde de tine. Contribuie la cauza noastră redirecționând 3.5% din impozitul tău pe venit către noi! Descarcă acum Formularul 230 și sprijină activitățile noastre fără niciun cost suplimentar pentru tine.

source: seo_keywords
ro: modus vivendi, oradea, ftc, first tech challenge, robotică competițională, stem education, echipa robotică, competiții robotică romania

source: Default Notification
ro: Notificare implicită

source: Default Logo
ro: Logo implicit

source: Default Content
ro: Conținut implicit

source: Welcome to our website! We are working on something great!
ro: Bun venit pe website-ul nostru! Lucrăm la ceva grozav!

source: Download Form 230
ro: Descarcă Formularul 230
